/* NSExecutableNotLoadableError */
"BundleErr3584" = "The bundle “%@” couldn’t be loaded because its executable isn’t loadable.";

/* NSExecutableNotLoadableError */
"BundleErr3584-C" = "The bundle’s executable isn’t loadable.";

/* NSExecutableNotLoadableError */
"BundleErr3584-R" = "Try reinstalling the bundle.";

/* NSExecutableArchitectureMismatchError */
"BundleErr3585" = "The bundle “%@” couldn’t be loaded because it doesn’t contain a version for the current architecture.";

/* NSExecutableArchitectureMismatchError */
"BundleErr3585-C" = "The bundle doesn’t contain a version for the current architecture.";

/* NSExecutableArchitectureMismatchError */
"BundleErr3585-R" = "Try installing a universal version of the bundle.";

/* NSExecutableRuntimeMismatchError */
"BundleErr3586" = "The bundle “%@” couldn’t be loaded because it isn’t compatible with the current application.";

/* NSExecutableRuntimeMismatchError */
"BundleErr3586-C" = "The bundle isn’t compatible with this application.";

/* NSExecutableRuntimeMismatchError */
"BundleErr3586-R" = "Try installing a newer version of the bundle.";

/* NSExecutableLoadError */
"BundleErr3587" = "The bundle “%@” couldn’t be loaded because it is damaged or missing necessary resources.";

/* NSExecutableLoadError */
"BundleErr3587-C" = "The bundle is damaged or missing necessary resources.";

/* NSExecutableLoadError */
"BundleErr3587-R" = "Try reinstalling the bundle.";

/* NSExecutableLinkError */
"BundleErr3588" = "The bundle “%@” couldn’t be loaded.";

/* NSExecutableLinkError */
"BundleErr3588-C" = "The bundle couldn’t be loaded.";

/* NSExecutableLinkError */
"BundleErr3588-R" = "Try reinstalling the bundle.";

/* NSFileNoSuchFileError */
"BundleErr4" = "The bundle “%@” couldn’t be loaded because its executable couldn’t be located.";

/* NSFileNoSuchFileError */
"BundleErr4-C" = "The bundle’s executable couldn’t be located.";

/* NSFileNoSuchFileError */
"BundleErr4-R" = "Try reinstalling the bundle.";

/* Name of the 'Cocoa' error domain when showing to user. Very likely this will not get localized. */
"NSCocoaErrorDomain" = "Cocoa";

/* Name of the 'Core Foundation' error domain when showing to user. Very likely this will not get localized differently in other languages. */
"NSCoreFoundationErrorDomain" = "Core Foundation";

/* Name of the 'Mach' error domain when showing to user. This probably will not get localized, unless there is a generally recognized phrase for 'Mach' in the language. */
"NSMachErrorDomain" = "Mach";

/* Name of the 'OSStatus' error domain when showing to user. Very likely this will not get localized. */
"NSOSStatusErrorDomain" = "OSStatus";

/* Name of the 'POSIX' error domain when showing to user. This probably will not get localized, unless there is a generally recognized phrase for 'POSIX' in the language. */
"NSPOSIXErrorDomain" = "POSIX";

/* A generic error string indicating there was a problem. The %@ will be replaced by a second sentence which indicates why the operation failed. */
"The operation couldn\\U2019t be completed. %@" = "The operation couldn’t be completed. %@";

/* A generic error string indicating there was a problem, followed by a parenthetical sentence which indicates error domain, code, and a description when there is no other way to present an error to the user. The first %@ indicates the error domain, %ld indicates the error code, and the second %@ indicates the description; so this might become '(Mach error 42 - Server error.)' for instance. */
"The operation couldn\\U2019t be completed. (%@ error %ld - %@)" = "The operation couldn’t be completed. (%1$@ error %2$ld - %3$@)";

/* A generic error string indicating there was a problem, followed by a parenthetical sentence which indicates error domain and code when there is no other way to present an error to the user. The %@ indicates the error domain while %ld indicates the error code; so this might become '(Mach error 42.)' for instance. */
"The operation couldn\\U2019t be completed. (%@ error %ld.)" = "The operation couldn’t be completed. (%1$@ error %2$ld.)";

